templates/templates_veggie/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| VEGGIE CFD -- blockMesh                                                      |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// The background mesh provides the spatial framework for snappyHexMesh.
// The domain must encompass the entire internal geometry with at least a 1-cell margin.
//
// Chamber: 292 (X) x 368 (Y) x ~365 (Z) mm
// Margins: -10 mm to max+10 mm
// Cell base size: ~3.333 mm (same as microgreen chamber m1)

xmin -0.01;
xmax 0.302;
ymin -0.01;
ymax 0.378;
zmin -0.01;
zmax 0.380; // Assuming max bellows 350 + 15 mm lightcap + 15 mm margin

// (0.302 - (-0.01)) / 0.0033333 = 0.312 / 0.0033333 = ~94
// (0.378 - (-0.01)) / 0.0033333 = 0.388 / 0.0033333 = ~116
// (0.380 - (-0.01)) / 0.0033333 = 0.390 / 0.0033333 = ~117

nx 94;
ny 116;
nz 117;

scale   1;

vertices
(
    ($xmin $ymin $zmin)
    ($xmax $ymin $zmin)
    ($xmax $ymax $zmin)
    ($xmin $ymax $zmin)
    ($xmin $ymin $zmax)
    ($xmax $ymin $zmax)
    ($xmax $ymax $zmax)
    ($xmin $ymax $zmax)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx $ny $nz) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
);

// ************************************************************************* //
