templates/templates_veggie/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| Microgreen chamber CFD -- schemes                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         cellLimited Gauss linear 1;
}

divSchemes
{
    default         none;

    // linearUpwind for momentum: second order but bounded enough for a jet in a
    // confined box. If the run will not converge, drop to `bounded Gauss upwind`
    // to get a starting field, then restart on linearUpwind -- do NOT report a
    // first-order result as final.
    //
    // ⚠ 2026-08-14 -- do NOT reach for upwind first on a LAMINAR case. The
    // laminar arm at Q = 1.25 m3/h stalled at 1.4e-1 and the cause was NOT the
    // scheme: with a top-hat inlet on a plain cutout the shear layer grows as
    // sqrt(nu*x/U) and at m0 it is not resolved anywhere in the domain
    // (x_res = 202 mm > the 186.7 mm path). Switching to upwind WOULD converge
    // it -- by adding numerical diffusion to a jet whose measured problem is
    // already too much diffusion, turning a visible failure into an invisible
    // one. `generate_case.sh` now prints x_res for every laminar case; check it
    // before touching this entry. See CLAUDE.md 7 and 5.2.
    div(phi,U)      bounded Gauss linearUpwind grad(U);

    div(phi,k)      bounded Gauss limitedLinear 1;
    div(phi,omega)  bounded Gauss limitedLinear 1;

    // The `age` function object builds its scheme name from `schemesField`
    // (functions/age) as div(phi,<schemesField>). With `default none` above,
    // omitting this is a FATAL IO ERROR at the FIRST WRITE TIME -- i.e. the
    // solver runs for hundreds of iterations and only then dies.
    div(phi,age)    bounded Gauss limitedLinear 1;

    div((nuEff*dev2(T(grad(U))))) Gauss linear;

    // --- Phase 2 (buoyantSimpleFoam) -------------------------------------
    div(phi,h)      bounded Gauss limitedLinear 1;
    div(phi,e)      bounded Gauss limitedLinear 1;
    div(phi,K)      bounded Gauss limitedLinear 1;
    div(phi,Ekp)    bounded Gauss limitedLinear 1;
    div(phid,p)     bounded Gauss upwind;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    // `limited corrected 0.33` rather than plain `corrected`: snappy meshes with
    // layers around a curved hood carry enough non-orthogonality that the
    // unlimited form oscillates. Revisit once checkMesh reports the actual value.
    default         Gauss linear limited corrected 0.33;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited corrected 0.33;
}

wallDist
{
    method          meshWave;
}

// ************************************************************************* //
